package RefAF;
use strict;

use vars qw($AFHEAD);
$AFHEAD = '=== 90e59a5c(0:1) write-back-cache schedule information ===';

use vars qw(%AFSYSID);
$AFSYSID{'90e59a5c'}  = 'AF1700';
$AFSYSID{'8e21d9c7'}  = 'AF2500-1';
$AFSYSID{'a4a47133'}  = 'AF2500-2';

# ---------- Array Fort コントローラリスト ---------- 
use vars qw($AFCTL);

$AFCTL = join ( "\n",
	'AF1700',
	'AF2500-1',
	'AF2500-2',
);

# ---------- Array Fort RAIDグループリスト ---------- 
use vars qw(%AFRAIDG);

$AFRAIDG{'AF1700'} = join ( "\n",
	0,
);

$AFRAIDG{'AF2500-1'} = join ( "\n",
	0,
	1,
	2,
);

$AFRAIDG{'AF2500-2'} = join ( "\n",
	0,
	1,
	2,
);

# ---------- Array Fort デバイスリスト ---------- 
use vars qw(%AFDEV);

$AFDEV{'AF1700'} = join ( "\n",
        'AF1700-00',
        'AF1700-01',
);

$AFDEV{'AF2500-1'} = join ( "\n",
        'AF2500-1-00',
        'AF2500-1-01',
        'AF2500-1-02',
        'AF2500-1-03',
        'AF2500-1-04',
        'AF2500-1-05',
        'AF2500-1-06',
        'AF2500-1-07',
        'AF2500-1-08',
        'AF2500-1-09',
        'AF2500-1-10',
        'AF2500-1-10',
        'AF2500-1-11',
        'AF2500-1-12',
        'AF2500-1-13',
        'AF2500-1-14',
        'AF2500-1-15',
        'AF2500-1-16',
        'AF2500-1-17',
        'AF2500-1-18',
        'AF2500-1-19',
        'AF2500-1-20',
        'AF2500-1-21',
        'AF2500-1-22',
        'AF2500-1-23',
        'AF2500-1-24',
);

$AFDEV{'AF2500-2'} = join ( "\n",
        'AF2500-2-00',
        'AF2500-2-01',
        'AF2500-2-02',
        'AF2500-2-03',
        'AF2500-2-04',
        'AF2500-2-05',
        'AF2500-2-06',
        'AF2500-2-07',
        'AF2500-2-08',
        'AF2500-2-09',
        'AF2500-2-10',
        'AF2500-2-10',
        'AF2500-2-11',
        'AF2500-2-12',
        'AF2500-2-13',
        'AF2500-2-14',
        'AF2500-2-15',
        'AF2500-2-16',
        'AF2500-2-17',
        'AF2500-2-18',
        'AF2500-2-19',
        'AF2500-2-20',
        'AF2500-2-21',
        'AF2500-2-22',
        'AF2500-2-23',
        'AF2500-2-24',
);

return 1;
