package RefAF;
use strict;

use vars qw($AFHEAD);
$AFHEAD = '15e4023a(0:0) write-back-cache schedule information';

use vars qw(%AFSYSID);
$AFSYSID{'15e4023a'}  = 'SC3000-1';
$AFSYSID{'58911E87'}  = 'SC3000-2';

# ---------- Array Fort コントローラリスト ---------- 
use vars qw($AFCTL);

$AFCTL = join ( "\n",
	'SC3000-1',
        'SC3000-2',
);

# ---------- Array Fort RAIDグループリスト ---------- 
use vars qw(%AFRAIDG);

$AFRAIDG{'SC3000-1'} = join ( "\n",
	0,
	1,
	2,
	3,
);
# ---------- Array Fort デバイスリスト ---------- 
use vars qw(%AFDEV);

$AFDEV{'SC3000-1'} = join ( "\n",
        'SC3000-1-00',
        'SC3000-1-01',
        'SC3000-1-02',
        'SC3000-1-03',
        'SC3000-1-04',
        'SC3000-1-05',
        'SC3000-1-06',
        'SC3000-1-07',
        'SC3000-1-08',
        'SC3000-1-09',
        'SC3000-1-10',
        'SC3000-1-11',
        'SC3000-1-12',
        'SC3000-1-13',
        'SC3000-1-14',
        'SC3000-1-15',
        'SC3000-1-16',
        'SC3000-1-17',
        'SC3000-1-18',
        'SC3000-1-19',
        'SC3000-1-20',
        'SC3000-1-21',
        'SC3000-1-22',
        'SC3000-1-23',
        'SC3000-1-24',
        'SC3000-1-25',
        'SC3000-1-26',
        'SC3000-1-27',
        'SC3000-1-28',
        'SC3000-1-29',
        'SC3000-1-30',
        'SC3000-1-31',
        'SC3000-1-32',
        'SC3000-1-33',
        'SC3000-1-34',
        'SC3000-1-35',
        'SC3000-1-36',
        'SC3000-1-37',
        'SC3000-1-38',
        'SC3000-1-39',
        'SC3000-1-40',
        'SC3000-1-41',
        'SC3000-1-42',
);

return 1;
